Section_4_Real_Workload_Validation/Experiment13/data/raw/case-B/sustained-ramp/trial_015/noisy-load.txt
Running 3m test @ http://127.0.0.1:18081/
  2 threads and 50 connections
  Thread calibration: mean lat.: 13.731ms, rate sampling interval: 31ms
  Thread calibration: mean lat.: 13.821ms, rate sampling interval: 31ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    16.99ms   10.52ms 244.35ms   95.62%
    Req/Sec   202.84     38.49     1.23k    83.72%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   15.18ms
 75.000%   17.39ms
 90.000%   21.26ms
 99.000%   42.65ms
 99.900%  173.18ms
 99.990%  238.98ms
 99.999%  243.46ms
100.000%  244.48ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       9.919     0.000000            1         1.00
      12.495     0.100000         6868         1.11
      13.183     0.200000        13665         1.25
      13.807     0.300000        20443         1.43
      14.471     0.400000        27245         1.67
      15.183     0.500000        33983         2.00
      15.567     0.550000        37372         2.22
      15.975     0.600000        40771         2.50
      16.415     0.650000        44271         2.86
      16.863     0.700000        47570         3.33
      17.391     0.750000        50968         4.00
      17.695     0.775000        52715         4.44
      18.031     0.800000        54389         5.00
      18.447     0.825000        56067         5.71
      19.023     0.850000        57785         6.67
      19.855     0.875000        59452         8.00
      20.447     0.887500        60299         8.89
      21.263     0.900000        61153        10.00
      22.255     0.912500        62014        11.43
      23.503     0.925000        62852        13.33
      24.927     0.937500        63702        16.00
      25.679     0.943750        64131        17.78
      26.495     0.950000        64549        20.00
      27.535     0.956250        64973        22.86
      28.511     0.962500        65400        26.67
      29.935     0.968750        65822        32.00
      30.799     0.971875        66034        35.56
      31.791     0.975000        66245        40.00
      32.863     0.978125        66461        45.71
      34.143     0.981250        66675        53.33
      36.191     0.984375        66884        64.00
      37.247     0.985938        66988        71.11
      38.687     0.987500        67095        80.00
      40.959     0.989062        67199        91.43
      44.095     0.990625        67309       106.67
      51.199     0.992188        67412       128.00
      57.695     0.992969        67465       142.22
      64.095     0.993750        67518       160.00
      71.999     0.994531        67571       182.86
      86.591     0.995313        67624       213.33
     101.695     0.996094        67677       256.00
     108.927     0.996484        67704       284.44
     117.375     0.996875        67730       320.00
     128.063     0.997266        67758       365.71
     143.359     0.997656        67784       426.67
     153.599     0.998047        67810       512.00
     157.439     0.998242        67823       568.89
     161.407     0.998437        67838       640.00
     164.607     0.998633        67850       731.43
     169.087     0.998828        67863       853.33
     173.695     0.999023        67876      1024.00
     177.407     0.999121        67883      1137.78
     180.351     0.999219        67889      1280.00
     185.471     0.999316        67896      1462.86
     188.799     0.999414        67903      1706.67
     194.431     0.999512        67909      2048.00
     197.887     0.999561        67913      2275.56
     199.167     0.999609        67916      2560.00
     207.103     0.999658        67919      2925.71
     216.575     0.999707        67923      3413.33
     222.207     0.999756        67926      4096.00
     225.535     0.999780        67928      4551.11
     227.199     0.999805        67929      5120.00
     231.807     0.999829        67931      5851.43
     236.671     0.999854        67933      6826.67
     238.335     0.999878        67934      8192.00
     238.975     0.999890        67935      9102.22
     239.231     0.999902        67936     10240.00
     240.127     0.999915        67937     11702.86
     240.895     0.999927        67938     13653.33
     240.895     0.999939        67938     16384.00
     241.023     0.999945        67939     18204.44
     241.023     0.999951        67939     20480.00
     242.687     0.999957        67940     23405.71
     242.687     0.999963        67940     27306.67
     242.687     0.999969        67940     32768.00
     243.455     0.999973        67941     36408.89
     243.455     0.999976        67941     40960.00
     243.455     0.999979        67941     46811.43
     243.455     0.999982        67941     54613.33
     243.455     0.999985        67941     65536.00
     244.479     0.999986        67942     72817.78
     244.479     1.000000        67942          inf
#[Mean    =       16.990, StdDeviation   =       10.521]
#[Max     =      244.352, Total count    =        67942]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  71991 requests in 3.00m, 58.56MB read
Requests/sec:    399.92
Transfer/sec:    333.13KB